In [2]:
# import pandas as pd
# import numpy as np

# tally total medals by country by event
# split data summer/winter
# Index by Country, columns by olymics
# Medals_Summer = {
#    'Country': ['USA', 'China', 'France', '...'],
#    'Medals_1996': [1, 2, 3, ...],
#    'Medals_2000': [1, 2, 3, ...],
#    'Medals_2004': [1, 2, 3, ...],        ......
#    'Medals_2008': [1, 2, 3, ...],
#    'Medals_2012': [1, 2, 3, ...],
#    'Medals_2016': [4, 5, 6, ...],
#    'Medals_2020': [3, 3, 1, ...],
#}

# df = pd.DataFrame(Medals_Summer)
# from sklearn.linear_model import LinearRegression

# X = df[['Medals_1996','Medals_2000', 'Medals_2004', 'Medals_2008','Medals_2012', 'Medals_2016', 'Medals_2020']]
# Y = target variable (2024 medal count)
# y = df['Predict_2024']

# model = LinearRegression()
# model.fit(X, y)

# prediction = model.predict(X)

# add prediction to the DataFrame
# df['Prediction__2024'] = predicted_medals

# Print the results
# print(df[['Country', 'Prediction_2024']])

In [4]:
import pandas as pd
import numpy as np

In [6]:
Medals_tally = pd.read_csv('Olympic_Games_Medal_Tally.csv')

In [10]:
Medals_tally.tail(2)

,edition,edition_id,year,country,country_noc,gold,silver,bronze,total
1805,1906 Intercalated,4,1906,Australia,AUS,0,0,3,3
1806,1906 Intercalated,4,1906,Bohemia,BOH,0,0,2,2

In [12]:
Medals_tally[['edy', 'eds']] = Medals_tally['edition'].str.split(' ', n=1, expand=True)

In [14]:
Medals_tally.tail(2)

,edition,edition_id,year,country,country_noc,gold,silver,bronze,total,edy,eds
1805,1906 Intercalated,4,1906,Australia,AUS,0,0,3,3,1906,Intercalated
1806,1906 Intercalated,4,1906,Bohemia,BOH,0,0,2,2,1906,Intercalated

In [16]:
df = Medals_tally

In [18]:
df = df.drop(df.columns[[0, 1, 3, 5,6,7,9]], axis=1)

In [20]:
df.head(2)

   year country_noc  total              eds
0  1896         USA     20  Summer Olympics
1  1896         GRE     47  Summer Olympics

In [22]:
df = df.drop(df[df.year < 1996].index)

In [24]:
df.head(2)

     year country_noc  total              eds
758  1996         USA    101  Summer Olympics
759  1996         RUS     63  Summer Olympics

In [26]:
dfsummer = df.drop(df[(df.eds != 'Summer Olympics')].index)

In [28]:
dfsummer.head(2)

     year country_noc  total              eds
758  1996         USA    101  Summer Olympics
759  1996         RUS     63  Summer Olympics

In [30]:
dfsummer.tail(2)

      year country_noc  total              eds
1341  2020         MDA      1  Summer Olympics
1342  2020         SYR      1  Summer Olympics

In [32]:
dfsummer = df

In [34]:
dfsummer2 = df.drop(df.columns[[3]], axis=1)

In [36]:
dfsummer2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 770 entries, 758 to 1781
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         770 non-null    int64
 1   country_noc  770 non-null    object
 2   total        770 non-null    int64
dtypes: int64(2), object(1)
memory usage: 40.2+ KB

In [38]:
dfsummer2.shape

(770, 3)

In [50]:
dfsummer2.head(2)

     year country_noc  total
758  1996         USA    101
759  1996         RUS     63

In [52]:
dfs1996 = dfsummer2.drop(df[df.year > 1996].index)

In [54]:
dfs1996.head()

     year country_noc  total
758  1996         USA    101
759  1996         RUS     63
760  1996         GER     65
761  1996         CHN     50
762  1996         FRA     37

In [58]:
dfs1996.shape

(79, 3)

In [60]:
print(dfs1996['total'].sum())

842